app/views/resources/index.html.erb

SELECT "resources".* FROM "resources"
---

      <% @topic.resources.each do |resource| %>