app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources"
---
  def index
    @resources = Resource.all

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # Find the resource we're interested in, passing in params[:id] to get the :id parameter from the request
    # @resource = Resource.find(params[:id])
    if params[:topic_id]
      @topic = Topic.find_by(id: params[:topic_id])
      if @topic.nil?
        redirect_to topics_path, alert: "Topic not found"
      end
      @resource = @topic.resources.find_by(id: params[:id])

INSERT INTO "resources" ("title", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ruby"], ["link", "Rubydocs.com"], ["created_at", 2016-10-31 12:22:34 UTC], ["updated_at", 2016-10-31 12:22:34 UTC]]
---
  def create                #=> params[:attribute] contains the attributes I'm interested in
    @resources = Resource.all
    @resource = current_user.resources.new(resource_params)
    # Saves the model in the database, returns a boolean if it's saved or not
    # if @resource.save fails in this situation, we need to show the form back to the user.
    if @resource.save

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @resource = Resource.find(params[:id])

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "resources" SET "link" = ?, "updated_at" = ? WHERE "resources"."id" = ?  [["link", "http://guides.rubyonrails.org/getting_started.html"], ["updated_at", 2016-10-31 14:31:01 UTC], ["id", 1]]
---
  def update
    @resource = Resource.find(params[:id])
    # if @resource.update(resource_params)
    if !current_user
      redirect_to new_user_session_path, alert: "You must be the author in order to edit a resource."
    elsif current_user != @resource.user
      redirect_to :back, alert: "You must be the author in order to edit a resource."
    else
      @resource.update(resource_params)

DELETE FROM "resources" WHERE "resources"."id" = ?  [["id", 1]]
---
  def destroy
    if !current_user
      redirect_to new_user_session_path, alert: "You must be the author in order to delete a resource."
    elsif current_user != @resource.user
      redirect_to :back, alert: "You must be the author in order to delete a resource."
    else
      @resource.destroy

SELECT  "resources".* FROM "resources" WHERE "resources"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_resource
      @resource = Resource.find(params[:id])