app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "Lani "], ["created_at", 2016-10-31 17:35:27 UTC], ["updated_at", 2016-10-31 17:35:27 UTC]]